app/contexts/pagos/infrastructure/repositories/payment_repository.rb

        def create(payment)
          PaymentRecord.create!(
            account_id: payment.account_id,
            amount: payment.amount,
            status: payment.status,
            paid_at: payment.paid_at
          )
---
INSERT INTO `payments` (`account_id`, `amount`, `status`, `paid_at`, `created_at`, `updated_at`) VALUES (1, 250, 'paid', '2025-07-16 19:51:25.400226', '2025-07-16 19:51:25.422433', '2025-07-16 19:51:25.422433')